ARMmbed/mbed-os/targets/TARGET_TOSHIBA/TARGET_TMPM4KN/Periph_Driver/src/rda_flash512ud32_b.c
/**
 *******************************************************************************
 * @file    rda_flash512ud32_b.c
 * @brief   This file provides API functions for FLASH rda.\n
 * @version V1.0.0
 *
 * DO NOT USE THIS SOFTWARE WITHOUT THE SOFTWARE LICENSE AGREEMENT.
 *
 * Copyright(C) Toshiba Electronic Device Solutions Corporation 2020
 *******************************************************************************
 */
#ifdef __cplusplus
extern "C" {
#endif

/*------------------------------------------------------------------------------*/
/*  Includes                                                                    */
/*------------------------------------------------------------------------------*/
#include <stdio.h>
#include <string.h>
#include "flash.h"
#include "TMPM4KNA.h"

#if defined(__FLASH_H)
/**
 *  @addtogroup Periph_Driver Peripheral Driver
 *  @{
 */

/**
 *  @addtogroup RDA_FLASH512UD32 RDA_FLASH512UD32
 *  @{
 */


/*------------------------------------------------------------------------------*/
/*  Configuration                                                               */
/*------------------------------------------------------------------------------*/
/**
 *  @addtogroup RDA_FLASH512UD32_Private_config RDA_FLASH512UD32 Private Config
 *  @{
 */


/**
 *  @}
 */ /* End of group RDA_FLASH512UD32_Private_config */


/*------------------------------------------------------------------------------*/
/*  Macro Definition                                                            */
/*------------------------------------------------------------------------------*/
/**
 *  @addtogroup RDA_FLASH512UD32_Private_define RDA_FLASH512UD32 Private Define
 *  @{
 */
#define FC_KCR_KEYCODE          (0xA74A9D23UL)              /*!< The specific code that writes the FCKCR register. */
#define FC_BRANK_VALUE          (uint32_t)(0xFFFFFFFFUL)    /*!< Brank value */
#define FC_MAX_PAGES            (uint8_t)(0x80)             /*!< Maxmum pages */
#define FC_MAX_BLOCKS           (uint8_t)(0x16)             /*!< Maxmum blocks */
#define FC_MAX_AREAS            (uint8_t)(0x1)              /*!< Maxmum areas */
#define FC_MAX_DATA_PAGES       (uint8_t)(0x21)             /*!< Maxmum pages */
#define FC_MAX_DATA_BLOCKS      (uint8_t)(0x8)              /*!< Maxmum blocks */
#define FC_CMD_ADDRESS_MASK     (uint32_t)(0xFFFF0000UL)    /*!< Upper address mask of the upper address */
#define FC_CMD_BC1_ADDR         (0x00000550UL)              /*!< The lower address of the first bus cycle when uses commans */
#define FC_CMD_BC2_ADDR         (0x00000AA0UL)              /*!< The lower address of the second bus cycle when uses commans */
#define FC_BANK_USER_INFO       (0x00000007UL)              /*!< Bank Change User Information Area */
#define FC_BANK_CODE_FLASH      (0x00000000UL)              /*!< Bank Change Code Flash */
#define FC_BUFFER_DISABLE       (0x00000007UL)              /*!< Flash Buffer Disable nad Clear */
#define FC_BUFFER_ENABLE        (0x00000000UL)              /*!< Flash Buffer Enable */

#define FC_PROTECT_ADDR         (0x00002000UL)              /*!< The lower address of protect command */
#define FC_SWAP_ADDR            (0x00003000UL)              /*!< The lower address of swap command */
#define FC_BUSY_MAX_WAIT        (0x00001000UL)              /*!< Busy wait count */

#define FC_ACCR_FDLC_4          (0x00000300UL)              /*!< Data Flash read clock 4clock   */
#define FC_ACCR_FDLC_5          (0x00000400UL)              /*!< Data Flash read clock 5clock   */
#define FC_ACCR_FDLC_6          (0x00000500UL)              /*!< Data Flash read clock 6clock   */
#define FC_ACCR_FCLC_1          (0x00000000UL)              /*!< Code Flash read clock 1clock   */
#define FC_ACCR_FCLC_2          (0x00000001UL)              /*!< Code Flash read clock 2clock   */
#define FC_ACCR_FCLC_3          (0x00000002UL)              /*!< Code Flash read clock 3clock   */
#define FC_ACCR_FCLC_4          (0x00000003UL)              /*!< Code Flash read clock 4clock   */
#define FC_ACCR_FCLC_5          (0x00000004UL)              /*!< Code Flash read clock 5clock   */
#define FC_ACCR_FCLC_6          (0x00000005UL)              /*!< Code Flash read clock 6clock   */
#define SYSCORECLOCK_80M        (80000000UL)                /*!< 80MHz                          */

/* FCSR0 register */
#define FC_AREASEL_EXPECT_AREA0 (uint32_t)(0x00000000UL)    /*!< RW, Selects expect area0       */
#define FC_AREASEL_EXPECT_AREA4 (uint32_t)(0x00000000UL)    /*!< RW, Selects expect area4       */
#define FC_AREASEL_AREA0        (uint32_t)(0x00000007UL)    /*!< RW, Selects area0              */
#define FC_AREASEL_AREA4        (uint32_t)(0x00070000UL)    /*!< RW, Selects area4              */
#define FC_AREASEL_MASK_AREA0   (uint32_t)(0xFF8F0FF8UL)    /*!< RW, Selects area0              */
#define FC_AREASEL_MASK_AREA4   (uint32_t)(0xFF880FFFUL)    /*!< RW, Selects area4              */
#define FC_AREASEL_WRITE_MODE   (uint32_t)(0x04000000UL)    /*!< R,  Write Mode                 */
#define FC_AREASEL4_WRITE_MODE  (uint32_t)(0x40000000UL)    /*!< R,  Write Mode                 */

#define FC_SEC_MASK             (uint32_t)(0x00000001UL)    /*!< Flash security bit mask  */
#define FC_SEC_ENABLE           (uint32_t)(0x00000001UL)    /*!< Flash security enable  */

static uint32_t fc_const_code_flash_address[FC_MAX_PAGES] = {
    (0x5E000000UL),   /*!< CODE FLASH Page0   */
    (0x5E001000UL),   /*!< CODE FLASH Page1   */
    (0x5E002000UL),   /*!< CODE FLASH Page2   */
    (0x5E003000UL),   /*!< CODE FLASH Page3   */
    (0x5E004000UL),   /*!< CODE FLASH Page4   */
    (0x5E005000UL),   /*!< CODE FLASH Page5   */
    (0x5E006000UL),   /*!< CODE FLASH Page6   */
    (0x5E007000UL),   /*!< CODE FLASH Page7   */
    (0x5E008000UL),   /*!< CODE FLASH Page8   */
    (0x5E009000UL),   /*!< CODE FLASH Page9   */
    (0x5E00A000UL),   /*!< CODE FLASH Page10  */
    (0x5E00B000UL),   /*!< CODE FLASH Page11  */
    (0x5E00C000UL),   /*!< CODE FLASH Page12  */
    (0x5E00D000UL),   /*!< CODE FLASH Page13  */
    (0x5E00E000UL),   /*!< CODE FLASH Page14  */
    (0x5E00F000UL),   /*!< CODE FLASH Page15  */
    (0x5E010000UL),   /*!< CODE FLASH Page16  */
    (0x5E011000UL),   /*!< CODE FLASH Page17  */
    (0x5E012000UL),   /*!< CODE FLASH Page18  */
    (0x5E013000UL),   /*!< CODE FLASH Page19  */
    (0x5E014000UL),   /*!< CODE FLASH Page20  */
    (0x5E015000UL),   /*!< CODE FLASH Page21  */
    (0x5E016000UL),   /*!< CODE FLASH Page22  */
    (0x5E017000UL),   /*!< CODE FLASH Page23  */
    (0x5E018000UL),   /*!< CODE FLASH Page24  */
    (0x5E019000UL),   /*!< CODE FLASH Page25  */
    (0x5E01A000UL),   /*!< CODE FLASH Page26  */
    (0x5E01B000UL),   /*!< CODE FLASH Page27  */
    (0x5E01C000UL),   /*!< CODE FLASH Page28  */
    (0x5E01D000UL),   /*!< CODE FLASH Page29  */
    (0x5E01E000UL),   /*!< CODE FLASH Page30  */
    (0x5E01F000UL)    /*!< CODE FLASH Page31  */
};

