ARMmbed/mbed-os/targets/TARGET_TOSHIBA/TARGET_TMPM4KN/Periph_Driver/src/rda_flash512ud32_b.c
static uint32_t fc_const_code_flash_block_address[FC_MAX_BLOCKS] = {
    (0x5E000000UL),   /*!< CODE FLASH Block0  */
    (0x5E008000UL),   /*!< CODE FLASH Block1  */
    (0x5E010000UL),   /*!< CODE FLASH Block2  */
    (0x5E018000UL),   /*!< CODE FLASH Block3  */
    (0x5E020000UL),   /*!< CODE FLASH Block4  */
    (0x5E028000UL),   /*!< CODE FLASH Block5  */
    (0x5E030000UL),   /*!< CODE FLASH Block6  */
    (0x5E038000UL),   /*!< CODE FLASH Block7  */
    (0x5E040000UL),   /*!< CODE FLASH Block8  */
    (0x5E048000UL),   /*!< CODE FLASH Block9  */
    (0x5E050000UL),   /*!< CODE FLASH Block10 */
    (0x5E058000UL),   /*!< CODE FLASH Block11 */
    (0x5E060000UL),   /*!< CODE FLASH Block12 */
    (0x5E068000UL),   /*!< CODE FLASH Block13 */
    (0x5E070000UL),   /*!< CODE FLASH Block14 */
    (0x5E078000UL)    /*!< CODE FLASH Block15 */
};

static uint32_t fc_const_data_flash_address[FC_MAX_DATA_PAGES] = {
    (0x30000000UL),   /*!< DATA FLASH Page0   */
    (0x30000100UL),   /*!< DATA FLASH Page1   */
    (0x30000200UL),   /*!< DATA FLASH Page2   */
    (0x30000300UL),   /*!< DATA FLASH Page3   */
    (0x30000400UL),   /*!< DATA FLASH Page4   */
    (0x30000500UL),   /*!< DATA FLASH Page5   */
    (0x30000600UL),   /*!< DATA FLASH Page6   */
    (0x30000700UL),   /*!< DATA FLASH Page7   */
    (0x30000800UL),   /*!< DATA FLASH Page8   */
    (0x30000900UL),   /*!< DATA FLASH Page9   */
    (0x30000A00UL),   /*!< DATA FLASH Page10  */
    (0x30000B00UL),   /*!< DATA FLASH Page11  */
    (0x30000C00UL),   /*!< DATA FLASH Page12  */
    (0x30000D00UL),   /*!< DATA FLASH Page13  */
    (0x30000E00UL),   /*!< DATA FLASH Page14  */
    (0x30000F00UL),   /*!< DATA FLASH Page15  */
    (0x30001000UL),   /*!< DATA FLASH Page16  */
    (0x30001100UL),   /*!< DATA FLASH Page17  */
    (0x30001200UL),   /*!< DATA FLASH Page18  */
    (0x30001300UL),   /*!< DATA FLASH Page19  */
    (0x30001400UL),   /*!< DATA FLASH Page20  */
    (0x30001500UL),   /*!< DATA FLASH Page21  */
    (0x30001600UL),   /*!< DATA FLASH Page22  */
    (0x30001700UL),   /*!< DATA FLASH Page23  */
    (0x30001800UL),   /*!< DATA FLASH Page24  */
    (0x30001900UL),   /*!< DATA FLASH Page25  */
    (0x30001A00UL),   /*!< DATA FLASH Page26  */
    (0x30001B00UL),   /*!< DATA FLASH Page27  */
    (0x30001C00UL),   /*!< DATA FLASH Page28  */
    (0x30001D00UL),   /*!< DATA FLASH Page29  */
    (0x30001E00UL),   /*!< DATA FLASH Page30  */
    (0x30001F00UL),   /*!< DATA FLASH Page31  */
    (0x30002000UL)    /*!< DATA FLASH Page32  */
};

static uint32_t fc_const_data_flash_block_address[FC_MAX_DATA_BLOCKS] = {
    (0x30000000UL),   /*!< DATA FLASH Block0 */
    (0x30001000UL),   /*!< DATA FLASH Block1 */
    (0x30002000UL),   /*!< DATA FLASH Block2 */
    (0x30003000UL),   /*!< DATA FLASH Block3 */
    (0x30004000UL),   /*!< DATA FLASH Block4 */
    (0x30005000UL),   /*!< DATA FLASH Block5 */
    (0x30006000UL),   /*!< DATA FLASH Block6 */
    (0x30007000UL)    /*!< DATA FLASH Block7 */
};

static uint32_t fc_const_data_flash_area_address[FC_MAX_AREAS] = {
    (0x30000000UL)   /*!< DATA FLASH AREA0 */
};

/**
 *  @}
 */ /* End of group RDA_FLASH512UD32_Private_define */


/*------------------------------------------------------------------------------*/
/*  Enumerated Type Definition                                                  */
/*------------------------------------------------------------------------------*/
/**
 *  @addtogroup RDA_FLASH512UD32_Private_enum RDA_FLASH512UD32 Private Enum
 *  @{
 */

/**
 *  @}
 */ /* End of group RDA_FLASH512UD32_Private_enum */


/*------------------------------------------------------------------------------*/
/*  Private Variables                                                           */
/*------------------------------------------------------------------------------*/
/**
 *  @addtogroup RDA_FLASH512UD32_Private_variables RDA_FLASH512UD32 Private Variables
 *  @{
 */

/**
 *  @}
 */ /* End of group RDA_FLASH512UD32_Private_variables */


/*------------------------------------------------------------------------------*/
/*  Private Function                                                            */
/*------------------------------------------------------------------------------*/
/**
 *  @addtogroup RDA_FLASH512UD32_Private_functions RDA_FLASH512UD32 Private Functions
 *  @{
 */
__STATIC_INLINE uint32_t fc_enable_areasel(void);
__STATIC_INLINE uint32_t fc_disable_areasel(void);
__STATIC_INLINE uint32_t fc_enable_areasel4(void);
__STATIC_INLINE uint32_t fc_disable_areasel4(void);

static void     fc_write_command(uint32_t *src_address, uint32_t *dst_address, uint32_t size);
static uint32_t fc_write_data_flash(uint32_t *src_address, uint32_t *dst_address, uint32_t size);

static void     fc_erase_command(uint32_t *flash_top_address, uint32_t *erase_top_address, fc_erase_kind_t kind);

static uint32_t fc_get_status(fc_sr0_t status);
static uint32_t fc_verify_check(uint32_t *src_address, uint32_t *dst_address, uint32_t size);
static uint32_t fc_blank_check(uint32_t *address, uint32_t size);

static void     Copy_Routine(uint32_t *dest, uint32_t *source, uint32_t size);

static void     fc_protect_program_command(uint32_t protect_bit, fc_protect_kind_t kind);
static void     fc_protect_erase_command(void);

static void     fc_bank_change(uint32_t bank);

__STATIC_INLINE uint32_t fc_protect_mask_set(uint32_t protect_bit, fc_protect_kind_t kind);

/*--------------------------------------------------*/
/**
  * @brief  Read clock set.
  * @param  -
  * @retval none.
  * @note   It works in the inner RAM.
  */
/*--------------------------------------------------*/
#if defined ( __GNUC__ )    /* GCC Compiler */
__attribute__((section(".ram_func")))
#endif
void fc_read_clock_set(void)
{
    uint32_t regval = 0;

    SystemCoreClockUpdate();
    if (SystemCoreClock > SYSCORECLOCK_80M) {
        regval = (uint32_t)(FC_ACCR_FDLC_5 | FC_ACCR_FCLC_5);
        TSB_FC->KCR = FC_KCR_KEYCODE;
        TSB_FC->FCACCR = regval;
        while (TSB_FC->FCACCR != (uint32_t)(FC_ACCR_FDLC_5 | FC_ACCR_FCLC_5)) {
            /* no processing */
        }
    } else {
        regval = (uint32_t)(FC_ACCR_FDLC_4 | FC_ACCR_FCLC_4);
        TSB_FC->KCR = FC_KCR_KEYCODE;
        TSB_FC->FCACCR = regval;
        while (TSB_FC->FCACCR != (uint32_t)(FC_ACCR_FDLC_4 | FC_ACCR_FCLC_4)) {
            /* no processing */
        }
    }
}

/*--------------------------------------------------*/
/**
  * @brief  fc fixed clock set.
  * @param  sysclock    : system clock (Hz)
  * @retval none.
  * @note   It works in the inner RAM.
  */
/*--------------------------------------------------*/
#if defined ( __GNUC__ )    /* GCC Compiler */
__attribute__((section(".ram_func")))
#endif
void fc_fixed_clock_set(uint32_t sysclock)
{
    uint32_t regval = 0;

    if (sysclock > SYSCORECLOCK_80M) {
        regval = (uint32_t)(FC_ACCR_FDLC_5 | FC_ACCR_FCLC_5);
        TSB_FC->KCR = FC_KCR_KEYCODE;
        TSB_FC->FCACCR = regval;
        while (TSB_FC->FCACCR != (uint32_t)(FC_ACCR_FDLC_5 | FC_ACCR_FCLC_5)) {
            /* no processing */
        }
    } else {
        regval = (uint32_t)(FC_ACCR_FDLC_4 | FC_ACCR_FCLC_4);
        TSB_FC->KCR = FC_KCR_KEYCODE;
        TSB_FC->FCACCR = regval;
        while (TSB_FC->FCACCR != (uint32_t)(FC_ACCR_FDLC_4 | FC_ACCR_FCLC_4)) {
            /* no processing */
        }
    }
}

/*--------------------------------------------------*/
/**
  * @brief  Check FCSR0_RDYBSY.
  * @param  -
  * @retval BUSY = 0
  * @note
  */
/*--------------------------------------------------*/
#if defined ( __GNUC__ )    /* GCC Compiler */
__attribute__((section(".ram_func")))
#endif
uint32_t Get_param_FC_RDYBSY(void)
{
    uint32_t retval = 0 ;

