ARMmbed/mbed-os/targets/TARGET_TOSHIBA/TARGET_TMPM4KN/Periph_Driver/src/rda_flash512ud32_b.c
    retval = TSB_FC->SR0 & FCSR0_RDYBSY_MASK ;

    return retval ;
}
#if  defined(_CC_ARM)
/*--------------------------------------------------*/
/**
  * @brief  copy fc_func.
  * @param  -
  * @retval -
  * @note
  */
/*--------------------------------------------------*/
void copy_fc_func(void)
{
    Copy_Routine(FLASH_API_RAM, FLASH_API_ROM, SIZE_FLASH_API);         /* copy flash API to RAM */

    return;
}

/*--------------------------------------------------*/
/**
  * @brief  copy user_data.
  * @param  -
  * @retval -
  * @note
  */
/*--------------------------------------------------*/
void copy_user_data(char *data_a, char *data_b, uint32_t size)
{
    /* copy A to RAM  */
    Copy_Routine(DEMO_A_RAM, (uint32_t *)data_a, size);

    /* copy B to RAM  */
    Copy_Routine(DEMO_B_RAM, (uint32_t *)data_b, size);

    return;
}

/*--------------------------------------------------*/
/**
  * @brief  copy user_program.
  * @param  -
  * @retval -
  * @note
  */
/*--------------------------------------------------*/
void copy_user_program(uint32_t size)
{
    /* copy A to RAM  */
    Copy_Routine(DEMO_A_RAM, DEMO_A_FLASH, size);

    /* copy B to RAM  */
    Copy_Routine(DEMO_B_RAM, DEMO_B_FLASH, size);

    return;
}

/*--------------------------------------------------*/
/**
  * @brief  rewrite_user_program.
  * @param  -
  * @retval -
  * @note
  */
/*--------------------------------------------------*/
uint32_t rewrite_user_program(uint32_t size)
{
    uint32_t ret;

    ret = fc_write_code_flash(DEMO_B_RAM, DEMO_A_FLASH, size);
    if (ret !=  TXZ_ERROR) {
        ret = fc_write_code_flash(DEMO_A_RAM, DEMO_B_FLASH, size);
        if (ret != TXZ_ERROR) {
            ret = TXZ_SUCCESS;
        }
    }

    return (ret);
}

#endif
/*--------------------------------------------------*/
/**
  * @brief  Auto protect erase command of the code flash ROM.
  * @param  -
  * @return Result.
  * @retval TXZ_SUCCESS : Success.
  * @retval TXZ_ERROR   : Failure.
  * @note   It works in the inner RAM.
  *         This function protect specified block of the code Flash ROM and checks a blank.
  */
/*--------------------------------------------------*/
#if defined ( __GNUC__ )    /* GCC Compiler */
__attribute__((section(".ram_func")))
#endif
uint32_t fc_protect_erase_code_flash(void)
{
    uint32_t retval = TXZ_SUCCESS;

    /* Checks the code Flash ROM status */
    if (fc_get_status(FC_SR0_RDYBSY) == TXZ_DONE) {
        /* Checks the number of maximum blocks. */
        fc_protect_erase_command();
    } else {
        retval = TXZ_ERROR;
    }

    return (retval);
}

/*--------------------------------------------------*/
/**
  * @brief  fc_write_page_data_flash.
  * @param  -
  * @retval -
  * @note
  */
/*--------------------------------------------------*/
#if defined ( __GNUC__ )    /* GCC Compiler */
__attribute__((section(".ram_func")))
#endif
uint32_t fc_write_page_data_flash(uint32_t page, uint32_t size)
{
    uint32_t ret;
    uint8_t  SetData[4], Data;
    uint32_t i;

    Data = 0;
    for (i = 0; i < size; i += 0x4U) {
        SetData[0] = Data++;
        SetData[1] = Data++;
        SetData[2] = Data++;
        SetData[3] = Data++;

        ret = fc_write_data_flash((uint32_t *)SetData,
                                  (uint32_t *)(fc_const_data_flash_address[page] + i),
                                  0x4);
    }

    return (ret);
}

/*--------------------------------------------------*/
/**
  * @brief  Auro page erase command of the user information area.
  * @param  -
  * @return Result.
  * @retval TXZ_SUCCESS :Success.
  * @retval TXZ_ERROR   :Failure.
  * @note   It works in the inner RAM.
  *         This function erases specified page of the code Flash ROM and checks a blank.
  */
/*--------------------------------------------------*/
#if defined ( __GNUC__ )    /* GCC Compiler */
__attribute__((section(".ram_func")))
#endif
uint32_t fc_erase_user_information_area(uint32_t User_Information_Area)
{
    uint32_t retval = TXZ_SUCCESS;

    /* Checks the code Flash ROM status */
    if (fc_get_status(FC_SR0_RDYBSY) == TXZ_DONE) {
        fc_bank_change(FC_BANK_USER_INFO);

        /* Erases the specific page. */
        fc_erase_command((uint32_t *)FC_CODE_FLASH_ADDRESS_TOP,
                         (uint32_t *)User_Information_Area,
                         FC_ERASE_KIND_PAGE);
        /* Checks a blank of the specific page. */
        if (fc_blank_check((uint32_t *)User_Information_Area, FC_PAGE_SIZE) == TXZ_ERROR) {
            retval = TXZ_ERROR;
        }

        fc_bank_change(FC_BANK_CODE_FLASH);
    } else {
        retval = TXZ_ERROR;
    }

    return (retval);
}

/*--------------------------------------------------*/
/**
  * @brief  Raed of the user information area.
  * @param  dst_address  :destination address
  * @param  size         :data size
  * @retval -
  * @note   It works in the inner RAM.
  */
/*--------------------------------------------------*/
#if defined ( __GNUC__ )    /* GCC Compiler */
__attribute__((section(".ram_func")))
#endif
void fc_read_user_information_area(uint32_t *src_address, uint32_t *dst_address, uint32_t size)
{
    fc_bank_change(FC_BANK_USER_INFO);

    {
        char *d = (char *)dst_address;
        char *s = (char *)src_address;
        int   i;
        for (i = 0; i < size; i++) {
            *d++ = *s++;
        }
    }

    fc_bank_change(FC_BANK_CODE_FLASH);
}

/*--------------------------------------------------*/
/**
  * @brief  Auto write command of the user information area.
  * @param  src_address  :source address
  * @param  size         :data size
  * @return Result.
  * @retval TXZ_SUCCESS :Success.
  * @retval TXZ_ERROR   :Failure.
  * @note   It works in the inner RAM.
  *         This function writes 16bytes data to the code Flash ROM.
  */
/*--------------------------------------------------*/
#if defined ( __GNUC__ )    /* GCC Compiler */
__attribute__((section(".ram_func")))
#endif
uint32_t fc_write_user_information_area(uint32_t *src_address, uint32_t size, uint32_t User_Information_Area)
{
    uint32_t retval = TXZ_SUCCESS;

