ARMmbed/mbed-os/targets/TARGET_TOSHIBA/TARGET_TMPM4KN/Periph_Driver/src/rda_flash512ud32_b.c
    /* Checks the code Flash ROM status */
    if (fc_get_status(FC_SR0_RDYBSY) == TXZ_DONE) {
        uint32_t i;

        fc_bank_change(FC_BANK_USER_INFO);

        /* Checks the code Flash ROM status */
        for (i = 0; i < size; i += (uint32_t)(0x10UL)) {
            /* Writes 16bytes data. */
            fc_write_command((uint32_t *)((uint32_t)src_address + i),
                             (uint32_t *)((uint32_t)User_Information_Area - FC_CODE_FLASH_ADDRESS_TOP + i),
                             (uint32_t)(0x10UL));
        }

        /* Verifies user data and data of the Flash ROM. */
        retval = fc_verify_check(src_address, (uint32_t *)User_Information_Area, size);

        fc_bank_change(FC_BANK_CODE_FLASH);
    }

    return (retval);
}

/*--------------------------------------------------*/
/**
  * @brief  Enables the AREA0.
  * @param  -
  * @return Result.
  * @retval TXZ_SUCCESS :Success.
  * @retval TXZ_ERROR   :Failure.
  * @note   It works in the inner RAM.
  *         This function write the FCAREASEL regiset.
  */
/*--------------------------------------------------*/
#if defined ( __GNUC__ )    /* GCC Compiler */
__attribute__((section(".ram_func")))
#endif
__STATIC_INLINE uint32_t fc_enable_areasel(void)
{
    uint32_t retval = TXZ_ERROR;
    uint32_t reg    = TSB_FC->AREASEL & FC_AREASEL_MASK_AREA0;

    reg |= FC_AREASEL_AREA0;
    /* Writes the FCKER register the KEYCODE. */
    TSB_FC->KCR = FC_KCR_KEYCODE;

    /* Selects the area0 */
    TSB_FC->AREASEL = reg;

    /* Confirms the FCAREASEL register the SSF0 was set. */
    while (1) {
        uint32_t i = TSB_FC->AREASEL;
        if ((i & FC_AREASEL_WRITE_MODE) == FC_AREASEL_WRITE_MODE) {
            retval = TXZ_SUCCESS;
            break;
        }
    }

    return (retval);
}

/*--------------------------------------------------*/
/**
  * @brief  Enables the AREA4.
  * @param  -
  * @return Result.
  * @retval TXZ_SUCCESS :Success.
  * @retval TXZ_ERROR   :Failure.
  * @note   It works in the inner RAM.
  *         This function write the FCAREASEL regiset.
  */
/*--------------------------------------------------*/
#if defined ( __GNUC__ )    /* GCC Compiler */
__attribute__((section(".ram_func")))
#endif
__STATIC_INLINE uint32_t fc_enable_areasel4(void)
{
    uint32_t retval = TXZ_ERROR;
    uint32_t reg    = TSB_FC->AREASEL & FC_AREASEL_MASK_AREA4;

    reg |= FC_AREASEL_AREA4;
    /* Writes the FCKER register the KEYCODE. */
    TSB_FC->KCR = FC_KCR_KEYCODE;

    /* Selects the area4 */
    TSB_FC->AREASEL = reg;

    /* Confirms the FCAREASEL register the SSF4 was set. */
    while (1) {
        uint32_t i = TSB_FC->AREASEL;
        if ((i & FC_AREASEL4_WRITE_MODE) == FC_AREASEL4_WRITE_MODE) {
            retval = TXZ_SUCCESS;
            break;
        }
    }

    return (retval);
}

/*--------------------------------------------------*/
/**
  * @brief  Disables the AREA0.
  * @param  -
  * @return Result.
  * @retval TXZ_SUCCESS :Success.
  * @retval TXZ_ERROR   :Failure.
  * @note   It works in the inner RAM.
  *         This function write the FCAREASEL regiset.
  */
/*--------------------------------------------------*/
#if defined ( __GNUC__ )    /* GCC Compiler */
__attribute__((section(".ram_func")))
#endif
__STATIC_INLINE uint32_t fc_disable_areasel(void)
{
    uint32_t retval = TXZ_ERROR;
    uint32_t reg    = TSB_FC->AREASEL & FC_AREASEL_MASK_AREA0;

    reg |= FC_AREASEL_EXPECT_AREA0;
    /* Writes the FCKER register the KEYCODE. */
    TSB_FC->KCR = FC_KCR_KEYCODE;

    /* Selects the area0 */
    TSB_FC->AREASEL = reg;

    /* Confirms the SSF0 of the FCAREASEL  register is not set. */
    while (1) {
        uint32_t i = TSB_FC->AREASEL;
        if ((i & FC_AREASEL_WRITE_MODE) != FC_AREASEL_WRITE_MODE) {
            retval = TXZ_SUCCESS;
            break;
        }
    }

    return (retval);
}

/*--------------------------------------------------*/
/**
  * @brief  Disables the AREA4.
  * @param  -
  * @return Result.
  * @retval TXZ_SUCCESS :Success.
  * @retval TXZ_ERROR   :Failure.
  * @note   It works in the inner RAM.
  *         This function write the FCAREASEL regiset.
  */
/*--------------------------------------------------*/
#if defined ( __GNUC__ )    /* GCC Compiler */
__attribute__((section(".ram_func")))
#endif
__STATIC_INLINE uint32_t fc_disable_areasel4(void)
{
    uint32_t retval = TXZ_ERROR;


    /* Writes the FCKER register the KEYCODE. */
    TSB_FC->KCR = FC_KCR_KEYCODE;

    /* Selects the area4 */
    TSB_FC->AREASEL = FC_AREASEL_EXPECT_AREA4;

    /* Confirms the SSF0 of the FCAREASEL  register is not set. */
    while (1) {
        uint32_t i = TSB_FC->AREASEL;
        if ((i & FC_AREASEL4_WRITE_MODE) != FC_AREASEL4_WRITE_MODE) {
            retval = TXZ_SUCCESS;
            break;
        }
    }

    return (retval);
}

/*--------------------------------------------------*/
/**
  * @brief  Writes data of the Flash ROM.
  * @param  src_address
  * @param  dst_address
  * @param  size
  * @return -
  * @note   It works in the inner RAM.
  */
/*--------------------------------------------------*/
#if defined ( __GNUC__ )    /* GCC Compiler */
__attribute__((section(".ram_func")))
#endif
static void fc_write_command(uint32_t *src_address, uint32_t *dst_address, uint32_t size)
{
    uint32_t retval;
    volatile uint32_t *addr1;
    volatile uint32_t *addr2;
    volatile uint32_t *addr3;
    uint32_t *source = (uint32_t *) src_address;

    if ((uint32_t)dst_address >= 0x30000000) {
        addr1 = (uint32_t *)((uint32_t)FC_CODE_DATA_ADDRESS_TOP + FC_CMD_BC1_ADDR);
        addr2 = (uint32_t *)((uint32_t)FC_CODE_DATA_ADDRESS_TOP + FC_CMD_BC2_ADDR);
        addr3 = (uint32_t *)((uint32_t)dst_address);
        /* Enables the AREA4. Write Mode. */
        retval = fc_enable_areasel4();
    } else {
        addr1 = (uint32_t *)((uint32_t)FC_CODE_FLASH_ADDRESS_TOP + FC_CMD_BC1_ADDR);
        addr2 = (uint32_t *)((uint32_t)FC_CODE_FLASH_ADDRESS_TOP + FC_CMD_BC2_ADDR);
        addr3 = (uint32_t *)((uint32_t)FC_CODE_FLASH_ADDRESS_TOP + (uint32_t)dst_address);
        /* Enables the AREA0. Write Mode. */
        retval = fc_enable_areasel();
    }

    if (retval == TXZ_SUCCESS) {
        uint32_t i;

