ARMmbed/mbed-os/targets/TARGET_TOSHIBA/TARGET_TMPM4KN/Periph_Driver/src/rda_flash512ud32_b.c
        *addr1 = (0x000000AAUL); /* bus cycle 1 */
        *addr2 = (0x00000055UL); /* bus cycle 2 */
        if ((uint32_t)dst_address >= 0x30000000) {
            *addr1 = (0x000000C0UL); /* bus cycle 3 */
        } else {
            *addr1 = (0x000000A0UL); /* bus cycle 3 */
        }
        for (i = (0UL); i < size; i += (0x4UL)) {
            *addr3 = *source;
            source++;
        }

        /* Confirmation of the works start of ROM. */
        while (fc_get_status(FC_SR0_RDYBSY) == TXZ_DONE) {};

        /* Waits for a finish of the works in the code Flash ROM. */
        while (fc_get_status(FC_SR0_RDYBSY) == TXZ_BUSY) {};
    }

    if ((uint32_t)addr1 > 0x5E000000) {
        /* Disables the AREA0. Read Mode. */
        retval = fc_disable_areasel();
    } else {
        /* Disables the AREA4. Read Mode. */
        retval = fc_disable_areasel4();
    }
}

/*--------------------------------------------------*/
/**
  * @brief  Verifies data of the Flash ROM.
  * @param  src_address  :source address
  * @param  dst_address  :destination address
  * @param  size         :data size
  * @return Result.
  * @retval TXZ_SUCCESS :Success.
  * @retval TXZ_ERROR   :Failure.
  * @note   It works in the inner RAM.
  */
/*--------------------------------------------------*/
#if defined ( __GNUC__ )    /* GCC Compiler */
__attribute__((section(".ram_func")))
#endif
static uint32_t fc_verify_check(uint32_t *src_address, uint32_t *dst_address, uint32_t size)
{
    char *s = (char *)src_address;
    char *d = (char *)dst_address;
    uint32_t i;
    for (i = 0; i < size; i++) {
        if (*s++ != *d++) {
            return (TXZ_ERROR);
        }
    }
    return (TXZ_SUCCESS);
}

/*--------------------------------------------------*/
/**
  * @brief  Auto page erase command of the flash ROM.
  * @param  flash top address
  * @param  erase top address
  * @param  kind               : Chip, Area, Block, Page, etc.
  * @return -
  * @note   This function erases specified place of the flash ROM.
  */
/*--------------------------------------------------*/
#if defined ( __GNUC__ )    /* GCC Compiler */
__attribute__((section(".ram_func")))
#endif
static void fc_erase_command(uint32_t *flash_top_address, uint32_t *erase_top_address, fc_erase_kind_t kind)
{
    uint32_t retval;
    volatile uint32_t *addr1 = (uint32_t *)((uint32_t)flash_top_address + FC_CMD_BC1_ADDR);
    volatile uint32_t *addr2 = (uint32_t *)((uint32_t)flash_top_address + FC_CMD_BC2_ADDR);
    volatile uint32_t *addr3 = (uint32_t *) erase_top_address;

    if ((uint32_t)addr1 > 0x5E000000) {
        /* Enables the AREA0. Write Mode. */
        retval = fc_enable_areasel();
    } else {
        /* Enables the AREA4. Write Mode. */
        retval = fc_enable_areasel4();
    }

    if (retval == TXZ_SUCCESS) {
        *addr1 = (0x000000AAUL);
        *addr2 = (0x00000055UL);
        *addr1 = (0x00000080UL);
        *addr1 = (0x000000AAUL);
        *addr2 = (0x00000055UL);
        *addr3 = kind;

        /* Confirmation of the works start of ROM. */
        {
            uint32_t busy_count = 0;
            while (fc_get_status(FC_SR0_RDYBSY) == TXZ_DONE) {
                if (++busy_count > FC_BUSY_MAX_WAIT) {
                    break;
                }
            };
        }

        /* Waits for a finish of the works in the code Flash ROM. */
        while (fc_get_status(FC_SR0_RDYBSY) == TXZ_BUSY) { };
    }
    if ((uint32_t)addr1 > 0x5E000000) {
        /* Disables the AREA0. Read Mode. */
        retval = fc_disable_areasel();
    } else {
        /* Disables the AREA4. Read Mode. */
        retval = fc_disable_areasel4();
    }
}

/*--------------------------------------------------*/
/**
  * @brief  Checks a blank of the Flash ROM every 4bytes.
  * @param  addrress
  * @param  size
  * @return Result.
  * @retval TXZ_SUCCESS :Success.
  * @retval TXZ_ERROR   :Failure.
  * @note   It works in the inner RAM.
  */
/*--------------------------------------------------*/
#if defined ( __GNUC__ )    /* GCC Compiler */
__attribute__((section(".ram_func")))
#endif
static uint32_t fc_blank_check(uint32_t *address, uint32_t size)
{
    uint32_t retval = TXZ_SUCCESS;
    uint32_t i;

    for (i = 0; i < (size / sizeof(uint32_t)); i++) {
        uint32_t *addr = &address[i];
        if (*addr != FC_BRANK_VALUE) {
            retval = TXZ_ERROR;
            break;
        }
    }

    return (retval);
}

/*--------------------------------------------------*/
/**
  * @brief  Get the status of the flash auto operation.
  * @param  status
  * @return Result.
  * @retval TXZ_BUSY : Busy.
  * @retval TXZ_DONE : Done.
  * @note   It works in the inner RAM.
  */
/*--------------------------------------------------*/
#if defined ( __GNUC__ )    /* GCC Compiler */
__attribute__((section(".ram_func")))
#endif
static uint32_t fc_get_status(fc_sr0_t status)
{
    uint32_t retval;
    uint32_t work32;

    /* Reads the FCSR0. Masks the other specfic status */
    work32 = TSB_FC->SR0 & (uint32_t)status;

    /* Confirms the specific status of the flash ROM */
    if (work32 == (uint32_t)status) {
        retval = TXZ_DONE;
    } else {
        retval = TXZ_BUSY;
    }

    return (retval);
}

/*--------------------------------------------------*/
/**
  * @brief  Auto write command of the code flash ROM.
  * @param  src_address  :source address
  * @param  dst_address  :destination address
  * @param  size         :data size
  * @return Result.
  * @retval TXZ_SUCCESS :Success.
  * @retval TXZ_ERROR   :Failure.
  * @note   It works in the inner RAM.
  *         This function writes 16bytes data to the code Flash ROM.
  */
/*--------------------------------------------------*/
#if defined ( __GNUC__ )    /* GCC Compiler */
__attribute__((section(".ram_func")))
#endif
uint32_t fc_write_code_flash(uint32_t *src_address, uint32_t *dst_address, uint32_t size)
{
    uint32_t retval = TXZ_SUCCESS;

    /* Checks the code Flash ROM status */
    if (fc_get_status(FC_SR0_RDYBSY) == TXZ_DONE) {
        uint32_t i;
        /* Checks the code Flash ROM status */
        for (i = 0; i < size; i += (uint32_t)(0x10UL)) {
            /* Writes 16bytes data. */
            fc_write_command((uint32_t *)((uint32_t)src_address + i),
                             (uint32_t *)((uint32_t)dst_address + i),
                             (uint32_t)(0x10UL));
        }

        /* Verifies user data and data of the Flash ROM. */
        retval = fc_verify_check(src_address, dst_address, size);
    }

    return (retval);
}

/*--------------------------------------------------*/
/**
  * @brief  Auto page erase command of the code flash ROM.
  * @param  first_page    : The first page to erase
  * @param  num_of_pages  : The number of pages to erase.
  * @return Result.
  * @retval TXZ_SUCCESS :Success.
  * @retval TXZ_ERROR   :Failure.
  * @note   It works in the inner RAM.
  *         This function erases specified page of the code Flash ROM and checks a blank.
  */
/*--------------------------------------------------*/
#if defined ( __GNUC__ )    /* GCC Compiler */
__attribute__((section(".ram_func")))
#endif
uint32_t fc_erase_page_code_flash(fc_code_flash_page_number_t first_page, uint8_t num_of_pages)
{
    uint32_t retval = TXZ_SUCCESS;

