ARMmbed/mbed-os/targets/TARGET_TOSHIBA/TARGET_TMPM4KN/Periph_Driver/src/rda_flash512ud32_b.c
    /* Checks the code Flash ROM status */
    if (fc_get_status(FC_SR0_RDYBSY) == TXZ_DONE) {
        /* Checks the number of maximum pages. */
        if ((first_page + num_of_pages) <= FC_MAX_PAGES) {
            uint8_t i;
            for (i = 0; i < num_of_pages; i++) {
                /* Erases the specific page. */
                fc_erase_command((uint32_t *)FC_CODE_FLASH_ADDRESS_TOP,
                                 (uint32_t *)fc_const_code_flash_address[first_page + i],
                                 FC_ERASE_KIND_PAGE);
            }
            /* Checks a blank of the specific page. */
            if (fc_blank_check((uint32_t *)fc_const_code_flash_address[first_page],
                               FC_PAGE_SIZE * (uint32_t)num_of_pages) == TXZ_ERROR) {
                retval = TXZ_ERROR;
            }
        } else {
            retval = TXZ_ERROR;
        }
    } else {
        retval = TXZ_ERROR;
    }

    return (retval);
}

/*--------------------------------------------------*/
/**
  * @brief  copy 32-bit data from source to dest
  * @param  the address of source and dast, the data size
  * @retval None.
  * @note   -
  */
/*--------------------------------------------------*/
#if defined ( __GNUC__ )    /* GCC Compiler */
__attribute__((section(".ram_func")))
#endif
static void Copy_Routine(uint32_t *dest, uint32_t *source, uint32_t size)
{
    uint32_t *dest_addr, *source_addr, tmpsize;
    uint32_t i, tmps, tmpd, mask;

    dest_addr   = dest;
    source_addr = source;

    tmpsize = size >> 2U;
    for (i = 0U; i < tmpsize; i++) {   /* 32bits copy */
        *dest_addr = *source_addr;
        dest_addr++;
        source_addr++;
    }
    if (size & 0x00000003U) {  /* if the last data size is not 0(maybe 1,2 or 3), copy the last data */
        mask = 0xFFFFFF00U;
        i = size & 0x00000003U;
        tmps = *source_addr;
        tmpd = *dest_addr;
        while (i - 1U) {
            mask = mask << 8U;
            i--;
        }
        tmps = tmps & (~mask);
        tmpd = tmpd & (mask);
        *dest_addr = tmps + tmpd;       /* 32bits copy, but only change the bytes need to be changed */
    } else {
        /* Do nothing */
    }
}

/*--------------------------------------------------*/
/**
  * @brief  Auto page erase command of the data flash.
  * @param  first_page    : The first page to erase
  * @param  num_of_pages  : The number of pages to erase.
  * @return Result.
  * @retval TXZ_SUCCESS :Success.
  * @retval TXZ_ERROR   :Failure.
  * @note   It works in the inner RAM.
  *         This function erases specified page of the data Flash and checks a blank.
  */
/*--------------------------------------------------*/
#if defined ( __GNUC__ )    /* GCC Compiler */
__attribute__((section(".ram_func")))
#endif
uint32_t fc_erase_page_data_flash(fc_data_flash_page_number_t first_page, uint8_t num_of_pages)
{
    uint32_t retval = TXZ_SUCCESS;

    /* Checks the data Flash status */
    if (fc_get_status(FC_SR0_RDYBSY) == TXZ_DONE) {
        /* Checks the number of maximum pages. */
        if ((first_page + num_of_pages) <= FC_MAX_DATA_PAGES) {
            uint8_t i;
            for (i = 0; i < num_of_pages; i++) {
                /* Erases the specific page. */
                fc_erase_command((uint32_t *)FC_DATA_FLASH_ADDRESS_TOP,
                                 (uint32_t *)fc_const_data_flash_address[first_page + i],
                                 FC_ERASE_KIND_PAGE);
            }
            /* Checks a blank of the specific page. */
            if (fc_blank_check((uint32_t *)fc_const_data_flash_address[first_page],
                               FC_DATA_PAGE_SIZE * (uint32_t)num_of_pages) == TXZ_ERROR) {
                retval = TXZ_ERROR;
            }
        } else {
            retval = TXZ_ERROR;
        }
    } else {
        retval = TXZ_ERROR;
    }

    return (retval);
}

/*--------------------------------------------------*/
/**
  * @brief  Auto write command of the data flash.
  * @param  src_address  :source address
  * @param  dst_address  :destination address
  * @param  size         :data size
  * @return Result.
  * @retval TXZ_SUCCESS :Success.
  * @retval TXZ_ERROR   :Failure.
  * @note   It works in the inner RAM.
  *         This function writes 16bytes data to the DATA Flash.
  */
/*--------------------------------------------------*/
#if defined ( __GNUC__ )    /* GCC Compiler */
__attribute__((section(".ram_func")))
#endif
static uint32_t fc_write_data_flash(uint32_t *src_address, uint32_t *dst_address, uint32_t size)
{
    uint32_t retval = TXZ_SUCCESS;

    /* Checks the code DATA Flash status */
    if (fc_get_status(FC_SR0_RDYBSY) == TXZ_DONE) {
        uint32_t i;
        /* Checks the DATA Flash status */
        for (i = 0; i < size; i += (uint32_t)(0x4UL)) {
            /* Writes 4bytes data. */
            fc_write_command((uint32_t *)((uint32_t)src_address + i),
                             (uint32_t *)((uint32_t)dst_address + i),
                             (uint32_t)(0x4UL));
        }
        /* Verifies user data and data of the Flash ROM. */
        retval = fc_verify_check(src_address, dst_address, size);
    } else {
        retval = TXZ_BUSY;
    }

    return (retval);
}

/*--------------------------------------------------*/
/**
  * @brief  Auto block erase command of the data flash.
  * @param  first_block      : The first block to erase
  * @param  num_of_block     : The number of blocks to erase.
  * @return Result.
  * @retval TXZ_SUCCESS :Success.
  * @retval TXZ_ERROR   :Failure.
  * @note   It works in the inner RAM.
  *         This function erases specified block of the data Flash and checks a blank.
  */
/*--------------------------------------------------*/
#if defined ( __GNUC__ )    /* GCC Compiler */
__attribute__((section(".ram_func")))
#endif
uint32_t fc_erase_block_data_flash(fc_data_flash_block_number_t first_block, uint8_t num_of_block)
{
    uint32_t retval = TXZ_SUCCESS;

    /* Checks the data Flash status */
    if (fc_get_status(FC_SR0_RDYBSY) == TXZ_DONE) {
        if ((first_block + num_of_block) <= FC_MAX_DATA_BLOCKS) {
            uint8_t i;
            for (i = 0; i < num_of_block; i++) {
                /* Erases the specific block. */
                fc_erase_command((uint32_t *)FC_DATA_FLASH_ADDRESS_TOP,
                                 (uint32_t *)fc_const_data_flash_block_address[first_block + i],
                                 FC_ERASE_KIND_BLOCK);
            }
            /* Checks a blank of the specific block. */
            if (fc_blank_check((uint32_t *)fc_const_data_flash_block_address[first_block],
                               FC_DATA_BLOCK_SIZE * (uint32_t)num_of_block) == TXZ_ERROR) {
                retval = TXZ_ERROR;
            }
        } else {
            retval = TXZ_ERROR;
        }
    } else {
        retval = TXZ_ERROR;
    }

    return (retval);
}

/*--------------------------------------------------*/
/**
  * @brief  Auto area erase command of the data flash.
  * @param  area      : The area block to erase
  * @return Result.
  * @retval TXZ_SUCCESS :Success.
  * @retval TXZ_ERROR   :Failure.
  * @note   It works in the inner RAM.
  *         This function erases specified block of the data Flash and checks a blank.
  */
/*--------------------------------------------------*/
#if defined ( __GNUC__ )    /* GCC Compiler */
__attribute__((section(".ram_func")))
#endif
uint32_t fc_erase_area_data_flash(fc_data_flash_area_number_t area)
{
    uint32_t retval = TXZ_SUCCESS;

