ARMmbed/mbed-os/targets/TARGET_TOSHIBA/TARGET_TMPM4KN/Periph_Driver/src/rda_flash512ud32_b.c
    /* Checks the data Flash status */
    if (fc_get_status(FC_SR0_RDYBSY) == TXZ_DONE) {
        /* Checks the number of maximum blocks. */
        if (area == 0) {
            /* Erases the specific block. */
            fc_erase_command((uint32_t *)FC_DATA_FLASH_ADDRESS_TOP,
                             (uint32_t *)fc_const_data_flash_area_address[area],
                             FC_ERASE_KIND_AREA);
            /* Checks a blank of the specific block. */
            if (fc_blank_check((uint32_t *)fc_const_data_flash_area_address[area], FC_DATA_AREA_SIZE) == TXZ_ERROR) {
                retval = TXZ_ERROR;
            }
        } else {
            retval = TXZ_ERROR;
        }
    } else {
        retval = TXZ_ERROR;
    }

    return (retval);
}

/*--------------------------------------------------*/
/**
  * @brief  Auto protect page program command of the code flash ROM.
  * @param  page      : The page to protect program
  * @return Result.
  * @retval TXZ_SUCCESS : Success.
  * @retval TXZ_ERROR   : Failure.
  * @note   It works in the inner RAM.
  *         This function protect specified block of the code Flash ROM and checks a blank.
  */
/*--------------------------------------------------*/
#if defined ( __GNUC__ )    /* GCC Compiler */
__attribute__((section(".ram_func")))
#endif
uint32_t fc_protect_page_code_flash(fc_code_flash_page_number_t page)
{
    uint32_t retval = TXZ_SUCCESS;

    /* Checks the code Flash ROM status */
    if (fc_get_status(FC_SR0_RDYBSY) == TXZ_DONE) {
        /* Checks the number of maximum blocks. */
        if (page <= FC_CODE_FLASH_PAGE7) {
            fc_protect_program_command(page, FC_PROTECT_KIND_PAGE);
        } else {
            retval = TXZ_ERROR;
        }
    } else {
        retval = TXZ_ERROR;
    }

    return (retval);
}

/*--------------------------------------------------*/
/**
  * @brief  Auto protect block program command of the code flash ROM.
  * @param  block      : The block to protect program
  * @return Result.
  * @retval TXZ_SUCCESS : Success.
  * @retval TXZ_ERROR   : Failure.
  * @note   It works in the inner RAM.
  *         This function protect specified block of the code Flash ROM and checks a blank.
  */
/*--------------------------------------------------*/
#if defined ( __GNUC__ )    /* GCC Compiler */
__attribute__((section(".ram_func")))
#endif
uint32_t fc_protect_block_code_flash(fc_code_flash_block_number_t block)
{
    uint32_t retval = TXZ_SUCCESS;

    /* Checks the code Flash ROM status */
    if (fc_get_status(FC_SR0_RDYBSY) == TXZ_DONE) {
        /* Checks the number of maximum blocks. */
        if ((block >= FC_CODE_FLASH_BLOCK1) && (block <= FC_CODE_FLASH_BLOCK3)) {
            fc_protect_program_command(block, FC_PROTECT_KIND_BLOCK);
        } else {
            retval = TXZ_ERROR;
        }
    } else {
        retval = TXZ_ERROR;
    }

    return (retval);
}

/*--------------------------------------------------*/
/**
  * @brief  Auto ptotect bit program command of the flash ROM.
  * @param  protect_bit
  * @param  kind
  * @return -
  * @note   This function protect specified place of the flash ROM.
  */
/*--------------------------------------------------*/
#if defined ( __GNUC__ )    /* GCC Compiler */
__attribute__((section(".ram_func")))
#endif
static void fc_protect_program_command(uint32_t protect_bit, fc_protect_kind_t kind)
{
    uint32_t retval = TXZ_SUCCESS;
    volatile uint32_t *addr1 = (uint32_t *)((uint32_t)FC_CODE_FLASH_ADDRESS_TOP + FC_CMD_BC1_ADDR);
    volatile uint32_t *addr2 = (uint32_t *)((uint32_t)FC_CODE_FLASH_ADDRESS_TOP + FC_CMD_BC2_ADDR);
    volatile uint32_t *addr3;

    if (kind == FC_PROTECT_KIND_PAGE) {
        if (protect_bit <= 7) {
            addr3 = (uint32_t *)(FC_CODE_FLASH_ADDRESS_TOP + FC_PROTECT_ADDR + (protect_bit << 4));
        } else {
            retval = TXZ_ERROR;
        }
    } else if (kind == FC_PROTECT_KIND_BLOCK) {
        if ((protect_bit >= 1) && (protect_bit <= 3)) {
            addr3 = (uint32_t *)(FC_CODE_FLASH_ADDRESS_TOP + FC_PROTECT_ADDR +  0x80 + ((protect_bit - 1) << 4));
        } else {
            retval = TXZ_ERROR;
        }
    } else {
        retval = TXZ_ERROR;
    }

    if (retval == TXZ_SUCCESS) {
        retval = fc_protect_mask_set(protect_bit, kind);
        /* Enables the AREA0. Write Mode. */
        retval = fc_enable_areasel();

        if (retval == TXZ_SUCCESS) {
            *addr1 = (0x000000AAUL);
            *addr2 = (0x00000055UL);
            *addr1 = (0x0000009AUL);
            *addr3 = (0x0000009AUL);

            /* Confirmation of the works start of ROM. */
            while (fc_get_status(FC_SR0_RDYBSY) == TXZ_DONE) {};

            /* Waits for a finish of the works in the code Flash ROM. */
            while (fc_get_status(FC_SR0_RDYBSY) == TXZ_BUSY) {};
        }
        /* Disables the AREA0. Read Mode. */
        retval = fc_disable_areasel();
    }
}

/*--------------------------------------------------*/
/**
  * @brief  Auto ptotect bit erase command of the flash ROM.
  * @param  -
  * @return -
  * @note   This function protect specified place of the flash ROM.
  */
/*--------------------------------------------------*/
#if defined ( __GNUC__ )    /* GCC Compiler */
__attribute__((section(".ram_func")))
#endif
static void fc_protect_erase_command(void)
{
    uint32_t retval = TXZ_SUCCESS;
    volatile uint32_t *addr1 = (uint32_t *)((uint32_t)FC_CODE_FLASH_ADDRESS_TOP + FC_CMD_BC1_ADDR);
    volatile uint32_t *addr2 = (uint32_t *)((uint32_t)FC_CODE_FLASH_ADDRESS_TOP + FC_CMD_BC2_ADDR);
    volatile uint32_t *addr3 = (uint32_t *)(FC_CODE_FLASH_ADDRESS_TOP           + FC_PROTECT_ADDR);

    {
        /* Enables the AREA0. Write Mode. */
        retval = fc_enable_areasel();

        if (retval == TXZ_SUCCESS) {
            *addr1 = (0x000000AAUL);
            *addr2 = (0x00000055UL);
            *addr1 = (0x00000080UL);
            *addr1 = (0x000000AAUL);
            *addr2 = (0x00000055UL);
            *addr3 = (0x00000060UL);

            /* Confirmation of the works start of ROM. */
            while (fc_get_status(FC_SR0_RDYBSY) == TXZ_DONE) {};

            /* Waits for a finish of the works in the code Flash ROM. */
            while (fc_get_status(FC_SR0_RDYBSY) == TXZ_BUSY) {};
        }
        /* Disables the AREA0. Read Mode. */
        retval = fc_disable_areasel();
    }
}

/*--------------------------------------------------*/
/**
  * @brief  Protect Mask Set.
  * @param  protect_bit
  * @param  kind
  * @return Result.
  * @retval TXZ_SUCCESS : Success.
  * @retval TXZ_ERROR   : Failure.
  * @note   It works in the inner RAM.
  *         This function write the FCAREASEL regiset.
  */
/*--------------------------------------------------*/
#if defined ( __GNUC__ )    /* GCC Compiler */
__attribute__((section(".ram_func")))
#endif
__STATIC_INLINE uint32_t fc_protect_mask_set(uint32_t protect_bit, fc_protect_kind_t kind)
{
    uint32_t retval = TXZ_ERROR;
    uint32_t reg = 0xFFFFFFFF;

    if (kind == FC_PROTECT_KIND_PAGE) {
        reg = (TSB_FC->PMR0) | (1 << protect_bit);
        /* Writes the FCKER register the KEYCODE. */
        TSB_FC->KCR = FC_KCR_KEYCODE;

        /* Selects the area0 */
        TSB_FC->PMR0 = reg;

        retval = TXZ_SUCCESS;
    } else if (kind == FC_PROTECT_KIND_BLOCK) {
        reg = (TSB_FC->PMR1) | (1 << protect_bit);
        /* Writes the FCKER register the KEYCODE. */
        TSB_FC->KCR = FC_KCR_KEYCODE;

        /* Selects the area0 */
        TSB_FC->PMR1 = reg;

        retval = TXZ_SUCCESS;
    }
    return (retval);
}

/*--------------------------------------------------*/
/**
  * @brief  Auto block erase command of the code flash ROM.
  * @param  first_block      : The first block to erase
  * @param  num_of_block     : The number of blocks to erase.
  * @return Result.
  * @retval TXZ_SUCCESS : Success.
  * @retval TXZ_ERROR   : Failure.
  * @note   It works in the inner RAM.
  *         This function erases specified block of the code Flash ROM and checks a blank.
  */
/*--------------------------------------------------*/
#if defined ( __GNUC__ )    /* GCC Compiler */
__attribute__((section(".ram_func")))
#endif
uint32_t fc_erase_block_code_flash(fc_code_flash_block_number_t first_block, uint8_t num_of_block)
{
    uint32_t retval = TXZ_SUCCESS;

