ARMmbed/mbed-os/targets/TARGET_TOSHIBA/TARGET_TMPM4KN/Periph_Driver/src/rda_flash512ud32_b.c
    /* Checks the code Flash ROM status */
    if (fc_get_status(FC_SR0_RDYBSY) == TXZ_DONE) {
        if ((first_block + num_of_block) <= FC_MAX_BLOCKS) {
            uint8_t i;
            for (i = 0; i < num_of_block; i++) {
                /* Erases the specific block. */
                fc_erase_command((uint32_t *)FC_CODE_FLASH_ADDRESS_TOP,
                                 (uint32_t *)fc_const_code_flash_block_address[first_block + i],
                                 FC_ERASE_KIND_BLOCK);
            }
            /* Checks a blank of the specific block. */
            if (fc_blank_check((uint32_t *)fc_const_code_flash_block_address[first_block], FC_BLOCK_SIZE * (uint32_t)num_of_block) == TXZ_ERROR) {
                retval = TXZ_ERROR;
            }
        } else {
            retval = TXZ_ERROR;
        }
    } else {
        retval = TXZ_ERROR;
    }

    return (retval);
}

/*--------------------------------------------------*/
/**
  * @brief  bank change.
  * @param  bank : FC_BANK_USER_INFO, FC_BANK_CODE_FLASH
  * @return -
  * @note   It works in the inner RAM.
  */
/*--------------------------------------------------*/
#if defined ( __GNUC__ )    /* GCC Compiler */
__attribute__((section(".ram_func")))
#endif
static void fc_bank_change(uint32_t bank)
{
    if (bank == FC_BANK_USER_INFO) {
        /* Flash Buffer disable */
        TSB_FC->BUFDISCLR = FC_BUFFER_DISABLE;
        while (TSB_FC->BUFDISCLR != FC_BUFFER_DISABLE);
        /* change user information area */
        TSB_FC->BNKCR = FC_BANK_USER_INFO;
        while (TSB_FC->BNKCR != FC_BANK_USER_INFO);
    } else if (bank == FC_BANK_CODE_FLASH) {
        /* change code flash */
        TSB_FC->BNKCR = FC_BANK_CODE_FLASH;
        while (TSB_FC->BNKCR != FC_BANK_CODE_FLASH);
        /* Flash Buffer enable */
        TSB_FC->BUFDISCLR = FC_BUFFER_ENABLE;
        while (TSB_FC->BUFDISCLR != FC_BUFFER_ENABLE);
    } else {
        /* do nothing */
    }
}

/*--------------------------------------------------*/


/**
 *  @}
 */ /* End of group RDA_FLASH512UD32_Private_functions */

/**
 *  @}
 */ /* End of group RDA_FLASH512UD32 */

/**
 *  @}
 */ /* End of group Periph_Driver */

#endif /* defined(__FLASH_H) */

#ifdef __cplusplus
}
#endif /* __cplusplus */
